<template lang="pug">
.root-nlp
	PraiIndexScreenNew
	PraiUiContent
		PraiUiListProducts(:products="products" subtitle="Виды решений")
		PraiUiBenefits(:benefits="benefits" class="blue" subtitle="Возможности" description="С нами ваш бизнес готов к грядущей эпохе NLP, где интеллектуальные системы преобразуют способ взаимодействия с миром.")
		PraiUiStep(:steps="steps")
		PraiNlpStack
		.container
			.title-block.center
				.subtitle-card.uppercase.blue Экспертность
				h2.title Почему мы
				.description Наша команда активно участвует в хакатонах по искусственному интеллекту и не раз завоёвывала призовые места. Наши успехи в хакатонах подтверждают нашу способность к инновациям, быстрому прототипированию и решению сложных задач. Мы настроены на достижение результатов и готовы разработать нейросеть, которая точно соответствует вашим потребностям и задачам.
		PraiIndexHacks.mb-50
		PraiUiCases
		PraiFeedbackGoose
</template>


<script setup>

	const PraiIndexScreenNew = defineAsyncComponent(() => import('/components/nlp/PraiIndexScreenNew.vue'))
	const PraiUiContent = defineAsyncComponent(() => import('/components/ui/PraiUiContent.vue'))
	const PraiUiListProducts = defineAsyncComponent(() => import('/components/ui/PraiUiListProducts.vue'))
	const PraiUiBenefits = defineAsyncComponent(() => import('/components/ui/PraiUiBenefits.vue'))
	const PraiUiStep = defineAsyncComponent(() => import('/components/ui/PraiUiStep.vue'))
	const PraiNlpStack = defineAsyncComponent(() => import('/components/nlp/PraiNlpStack.vue'))
	const PraiIndexHacks = defineAsyncComponent(() => import('/components/index/PraiIndexHacks.vue'))
	const PraiUiCases = defineAsyncComponent(() => import('/components/ui/PraiUiCases.vue'))
	const PraiFeedbackGoose = defineAsyncComponent(() => import('/components/feedback/PraiFeedbackGoose.vue'))

	import {useHeaderStore} from "/store/header";
	import {onMounted} from "vue";
	const store = useHeaderStore()

	onMounted(() => {
		store.setHeader({
			logo: '#3843FF',
			opacity: 0.78,
			border: 'rgba(4, 125, 255, 0.42)',
			bgHeader: '10, 10, 10,',
			colorHeader: '#ffffff',
		})
	})

	const defaultTitle = 'Разработка искусственного интелекта, нейронных сетей на заказ «под ключ», машинное обучение'
	const defaultDescription = 'Разрабатываем нейронные сети, искусственный интелект на заказ - «под ключ», анализ, машинное обучение (learn machine), внедрение. Обработка датасетов, автоматизация бизнеса. Проконсультироваться со специалистами ☎️ +7 (995) 226-07-38'
	useHead({
		title: defaultTitle,
		meta: [
			{ name: 'description', content: defaultDescription },
			{ property: 'og:title', content: defaultTitle },
			{ property: 'og:description', content: defaultDescription },
			{ property: 'og:type', content: 'article' },
			{ property: 'article:author', content: 'Компания разработчик PRAI' },
			{ property: 'article:section', content: 'Нейросети'},
			{ property: 'article:tag', content: 'NLP'},
			{ property: 'article:tag', content: 'AI'},
			{ property: 'article:tag', content: 'ИИ'},
			{ property: 'article:tag', content: 'Машинное обучение'},
			{ property: 'article:published_time', content: '2024-07-01T19:24:06+00:00' },
			{ property: 'article:modified_time', content: '2024-07-01T19:24:06+00:00' },
		]
	})

	const products = [
		{
			title: 'Автоматизированные текстовые анализы',
			desc: 'Создание мощных инструментов для автоматизации анализа текстовых данных. Извлекайте ключевые сущности, эмоциональную окраску и тематику с высокой точностью.',
			icon: 'text.svg',
			color: '#FA0096'
		},
		{
			title: 'Голосовые ассистенты следующего поколения',
			desc: 'Разработка голосовых ассистентов, которые понимают и генерируют естественный язык. Обеспечьте более глубокое взаимодействие с вашими пользователями.',
			icon: 'voice.svg',
			color: '#5F00FA'
		},
		{
			title: 'Персонализированные рекомендации',
			desc: 'Создание систем рекомендаций, основанных на понимании контекста и предпочтений пользователя. Повысьте эффективность маркетинга и удовлетворенность клиентов.',
			icon: 'recommend.svg',
			color: '#0073FA'
		},
		{
			title: 'Анализ настроений в социальных медиа',
			desc: 'Разработка инструментов для анализа настроений и мнений в текстах из социальных медиа. Получите ценные инсайты для принятия стратегических решений.',
			icon: 'comment.svg',
			color: '#FA0000'
		},
		{
			title: 'Машинный перевод нового поколения',
			desc: 'Создание передовых систем машинного перевода с учетом контекста и нюансов языка. Сократите границы между культурами и языками.',
			icon: 'translate.svg',
			color: '#1FDE49'
		},
		{
			title: 'HR - расчёт эффективности сотрудников',
			desc: 'Расчёт эффективности помогает понять на сколько хорошо работает ваше предприятие, а также позволяет провести коррекцию стратегии или процессов для увеличения прибыли.',
			icon: 'people.svg',
			color: '#FAF000'
		},
		{
			title: 'Контроль качества на производстве',
			desc: 'Реализация виртуальных помощников, способных предоставлять быстрые и точные ответы на вопросы клиентов, улучшая опыт обслуживания.',
			icon: 'box-search.svg',
			color: '#00BEFA'
		},
		{
			title: 'Кластеризация покупателей',
			desc: 'Зная подробный портрет вашего покупателя, компания может гораздо эффективнее разрабатывать маркетинговые программы, а также менять продукт под клиента.',
			icon: 'people-chat.svg',
			color: '#FA9600'
		},
		{
			title: 'Оптимизация городской среды',
			desc: 'Помогает оптимизировать маршруты общественного городского транспорта. Провести аналитику пассажиропотока. Повысить безопасность на дорогах и развязках.',
			icon: 'city.svg',
			color: '#74DC8B'
		},
	]
	const benefits = [
		{
			title: 'Точность и производительность',
			desc: 'Наши нейросети NLP обеспечивают высокую точность в обработке текста, что позволяет получить более точные аналитические результаты и эффективные решения.'
		},
		{
			title: 'Глубокое понимание контекста',
			desc: 'Мы разрабатываем модели, способные улавливать сложные контекстуальные зависимости в тексте, что обеспечивает более интеллектуальное взаимодействие.'
		},
		{
			title: 'Пользовательская адаптация',
			desc: 'Наши решения настраиваются под уникальные потребности клиента, обеспечивая максимальную релевантность и ценность результатов.'
		},
		{
			title: 'Сокращение затрат времени и ресурсов',
			desc: 'Автоматизированный анализ текста и генерация контента позволяют сократить временные и финансовые затраты на рутинные задачи.'
		},
		{
			title: 'Конкурентное преимущество',
			desc: 'Использование передовых нейросетей NLP помогает вашему бизнесу оставаться впереди конкурентов и внедрять инновации на рынке.'
		},
		{
			title: 'Масштабируемость и гибкость',
			desc: 'Наши решения могут быть масштабированы под любой объем данных и потребности, обеспечивая надежную и гибкую инфраструктуру для развития бизнеса.'
		},
	]
	const steps = [
		{
			title: 'Анализ требований и подготовка данных',
			icon: 'analise.svg',
			list: [
				'Определение целей и задач проекта;',
				'Сбор и очистка данных, необходимых для обучения и тестирования модели;',
				'Токенизация текстов и преобразование данных в числовой формат.'
			]
		},
		{
			title: 'Выбор и настройка модели',
			icon: 'code.svg',
			list: [
				'Выбор архитектуры нейросети, наилучшей подходящей для задачи NLP;',
				'Настройка параметров модели, включая гиперпараметры.',
			]
		},
		{
			title: 'Обучение модели',
			icon: 'clock.svg',
			list: [
				'Разбиение данных на тренировочный, валидационный и тестовый наборы;',
				'Обучение модели на тренировочных данных;',
				'Оценка и настройка модели на валидационных данных.'
			]
		},
		{
			title: 'Оценка и тестирование',
			icon: 'test.svg',
			list: [
				'Оценка производительности модели с использованием метрик, соответствующих задаче;',
				'Тестирование модели на отложенном тестовом наборе данных.'
			]
		},
		{
			title: 'Оптимизация, настройка и внедрение',
			icon: 'support.svg',
			list: [
				'Исправление проблем и улучшение производительности модели на основе результатов тестирования;',
				'Оптимизация скорости и эффективности работы модели, включая уменьшение объема памяти и времени вычислений;',
				'Интеграция обученной модели в рабочее окружение клиента.'
			]
		},
		{
			title: 'Мониторинг и поддержка',
			icon: 'client.svg',
			list: [
				'Регулярное мониторинг производительности модели в "боевых" условиях;',
				'Реагирование на изменения в данных и обновление модели при необходимости;',
				'Техническая поддержка и обслуживание клиента.'
			]
		},
		{
			title: 'Документация и передача знаний',
			icon: 'task.svg',
			list: [
				'Создание документации по модели и процессу обучения;',
				'Передача знаний заказчику или внутренним сотрудникам клиента для последующей поддержки и развития.',
			]
		},
	]
</script>

<style scoped lang="scss">
	.root-nlp{
		padding-top: 100vh;
	}
</style>