<template lang="pug">
.root-nlp
	PraiNlpScreen
	PraiUiListProducts(:products="products" subtitle="Виды решений")
	PraiUiBenefits(:benefits="benefits" class="light-pink" subtitle="Возможности" description="С нами ваш бизнес готов к грядущей эпохе NLP, где интеллектуальные системы преобразуют способ взаимодействия с миром.")
	PraiUiStep(:steps="steps")
	// Стек под нейронки
	.container
		.title-block.center
			.subtitle-card.uppercase.blue Экспертность
			h2.title Почему мы
			.description Наша команда активно участвует в хакатонах по искусственному интеллекту и не раз завоёвывала призовые места. Наши успехи в хакатонах подтверждают нашу способность к инновациям, быстрому прототипированию и решению сложных задач. Мы настроены на достижение результатов и готовы разработать нейросеть, которая точно соответствует вашим потребностям и задачам.
	PraiIndexHacks.mb-50
	PraiUiCases
	PraiUiFeedback
</template>


<script>
	import PraiNlpScreen from "/components/nlp/PraiNlpScreen.vue";
	import PraiUiListProducts from "/components/ui/PraiUiListProducts.vue";
	import PraiUiBenefits from "/components/ui/PraiUiBenefits.vue";
	import PraiUiStep from "/components/ui/PraiUiStep.vue";
	import PraiIndexHacks from "/components/index/PraiIndexHacks.vue";
	import PraiUiCases from "/components/ui/PraiUiCases.vue";
	import PraiUiFeedback from "/components/ui/PraiUiFeedback.vue";
	export default {
		data(){
			return{
				products: [
					{
						title: 'Автоматизированные текстовые анализы',
						desc: 'Создание мощных инструментов для автоматизации анализа текстовых данных. Извлекайте ключевые сущности, эмоциональную окраску и тематику с высокой точностью.',
						icon: 'test.svg',
						color: '#FA0096'
					},
					{
						title: 'Голосовые ассистенты следующего поколения',
						desc: 'Разработка голосовых ассистентов, которые понимают и генерируют естественный язык. Обеспечьте более глубокое взаимодействие с вашими пользователями.',
						icon: 'test.svg',
						color: '#5F00FA'
					},
					{
						title: 'Персонализированные рекомендации',
						desc: 'Создание систем рекомендаций, основанных на понимании контекста и предпочтений пользователя. Повысьте эффективность маркетинга и удовлетворенность клиентов.',
						icon: 'test.svg',
						color: '#0073FA'
					},
					{
						title: 'Анализ настроений в социальных медиа',
						desc: 'Разработка инструментов для анализа настроений и мнений в текстах из социальных медиа. Получите ценные инсайты для принятия стратегических решений.',
						icon: 'test.svg',
						color: '#FA0000'
					},
					{
						title: 'Машинный перевод нового поколения',
						desc: 'Создание передовых систем машинного перевода с учетом контекста и нюансов языка. Сократите границы между культурами и языками.',
						icon: 'test.svg',
						color: '#1FDE49'
					},
					{
						title: 'Автоматизация клиентской поддержки',
						desc: 'Реализация виртуальных помощников, способных предоставлять быстрые и точные ответы на вопросы клиентов, улучшая опыт обслуживания.',
						icon: 'test.svg',
						color: '#FA9600'
					},
				],
				benefits: [
					{
						title: 'Точность и производительность',
						desc: 'Наши нейросети NLP обеспечивают высокую точность в обработке текста, что позволяет получить более точные аналитические результаты и эффективные решения.'
					},
					{
						title: 'Глубокое понимание контекста',
						desc: 'Мы разрабатываем модели, способные улавливать сложные контекстуальные зависимости в тексте, что обеспечивает более интеллектуальное взаимодействие.'
					},
					{
						title: 'Пользовательская адаптация',
						desc: 'Наши решения настраиваются под уникальные потребности клиента, обеспечивая максимальную релевантность и ценность результатов.'
					},
					{
						title: 'Сокращение затрат времени и ресурсов',
						desc: 'Автоматизированный анализ текста и генерация контента позволяют сократить временные и финансовые затраты на рутинные задачи.'
					},
					{
						title: 'Конкурентное преимущество',
						desc: 'Использование передовых нейросетей NLP помогает вашему бизнесу оставаться впереди конкурентов и внедрять инновации на рынке.'
					},
					{
						title: 'Масштабируемость и гибкость',
						desc: 'Наши решения могут быть масштабированы под любой объем данных и потребности, обеспечивая надежную и гибкую инфраструктуру для развития бизнеса.'
					},
				],
				steps: [
					{
						title: 'Анализ требований и подготовка данных',
						icon: 'analise.svg',
						list: [
							'Определение целей и задач проекта;',
							'Сбор и очистка данных, необходимых для обучения и тестирования модели;',
							'Токенизация текстов и преобразование данных в числовой формат.'
						]
					},
					{
						title: 'Выбор и настройка модели',
						icon: 'code.svg',
						list: [
							'Выбор архитектуры нейросети, наилучшей подходящей для задачи NLP;',
							'Настройка параметров модели, включая гиперпараметры.',
						]
					},
					{
						title: 'Обучение модели',
						icon: 'clock.svg',
						list: [
							'Разбиение данных на тренировочный, валидационный и тестовый наборы;',
							'Обучение модели на тренировочных данных;',
							'Оценка и настройка модели на валидационных данных.'
						]
					},
					{
						title: 'Оценка и тестирование',
						icon: 'test.svg',
						list: [
							'Оценка производительности модели с использованием метрик, соответствующих задаче;',
							'Тестирование модели на отложенном тестовом наборе данных.'
						]
					},
					{
						title: 'Оптимизация, настройка и внедрение',
						icon: 'support.svg',
						list: [
							'Исправление проблем и улучшение производительности модели на основе результатов тестирования;',
							'Оптимизация скорости и эффективности работы модели, включая уменьшение объема памяти и времени вычислений;',
							'Интеграция обученной модели в рабочее окружение клиента.'
						]
					},
					{
						title: 'Мониторинг и поддержка',
						icon: 'client.svg',
						list: [
							'Регулярное мониторинг производительности модели в "боевых" условиях;',
							'Реагирование на изменения в данных и обновление модели при необходимости;',
							'Техническая поддержка и обслуживание клиента.'
						]
					},
					{
						title: 'Документация и передача знаний',
						icon: 'task.svg',
						list: [
							'Создание документации по модели и процессу обучения;',
							'Передача знаний заказчику или внутренним сотрудникам клиента для последующей поддержки и развития.',
						]
					},
				],
			}
		},
		created() {
			this.$store.commit('setHeader', {
				logo: '#DE39E1',
				opacity: 0.78,
				border: 'rgba(250, 0, 150, 0.08)',
				bgHeader: '10, 10, 10,',
				colorHeader: '#ffffff',
			})
		},
		components: {
			PraiNlpScreen, PraiUiListProducts, PraiUiBenefits,
			PraiUiStep, PraiIndexHacks, PraiUiCases,
			PraiUiFeedback
		},

	}
</script>
